# encoding: utf-8
class Category <  ActiveRecord::Base
 def self.init_cate
   b =[
      ['农业机械',
       [
       ['耕整机械',['耕整机','铧式犁','翻转犁','圆盘犁','旋耕机','松土机','灭茬机','平地机','挖坑机','开沟起垄机' ,'联合整地机']],
       ['种植施肥机械', ['播种机' ,'条播机' ,'穴播机' ,'栽植机','插秧机' ,'移栽机' ,'施肥机' ,'追肥机' ,'地膜机','食用菌生产机械']],
       ['植保机械', ['中耕机' ,'培土机','除草机' ,'烟雾机' ,'喷雾器','绿篱机','剪草机' ,'喷粉机' ,'割草机','其他']],
       ['收获机械', ['收割机','收获机' ,'脱粒机' ,'摘果机','打捆机','剥壳机' ,'清选机','干燥机械','仓储设备','种子加工机']],
       ['排灌机械', ['喷灌系列','滴灌系列','微喷系列','温室大棚系列' ,'过滤器','PE管材管件' ,'PVC管材管件','出水口（阀）']],
       ['粮油机械',  ['碾米机' ,'抛光机' ,'吸粮机' ,'分级筛','去石机' ,'谷糙分离机' ,'榨油机' ,'预榨机' ,'精炼设备','浸出设备']],
       ['棉花机械', ['清弹机' ,'梳理机' ,'弹花机' ,'轧花机' ,'提绒机组','棉花打包机']],
       ['果蔬机械',['选果机' ,'果袋机' ,'去核机' ,'去皮机' ,'预煮机' ,'分级机' ,'果蔬打浆机','果蔬破碎机' ,'果蔬清洗机','果蔬榨汁机']],
       ['茶叶机械', ['采茶机' ,'揉捻机' ,'杀青机' ,'炒茶机' ,'烘干机' ,'理条机' ,'拣梗机' ,'提香机','切茶机' ,'包揉机','真空包装机']],
       ['饲料机械', ['混合机' ,'制粒机' ,'粉碎机' ,'膨化机','干燥机','分级设备 ','冷却喷涂','包装配料' ,'除尘清理' ,'饲料成套设备']],
       ['肥料机械', ['粉碎设备' ,'干燥设备' ,'冷却设备' ,'制粒设备','筛分设备','混合搅拌','定量包装','肥料生产线']],
       ['畜牧饲养机械', ['养鸡设备' ,'养猪设备' ,'孵化设备 ' ,'风机系列 ','供暖设备 ','水产养殖设备 ','抓捕设备' ,'屠宰设备','其他']],
       ['动力输送机械', ['汽油机',' 柴油机 ','发动机','拖拉机','装卸车','升降台 ','输送机','提升机','给料机','装载机','叉车']],
       ['农机配件',['收获机配件' ,'微耕机配件','旋耕机配件' ,'插秧机配件' ,'农用机配件' ,'割草机配件' ,'拖拉机配件','农业仪器']]
       ]
      ],['农业化肥',
         [
             ['复合肥/复混肥',['钙镁磷钾肥','氮钾二元复混肥','硝酸铵钙','硝酸铵磷','磷酸二氢钾型复合肥','氮磷钾复合肥','磷酸一铵','磷酸二铵','高浓度磷复肥','磷酸二氢钾按','磷铵钾肥合肥','磷铵硼肥','尿基磷铵 ','氯化钾铵','花肥','氮磷钾三元复混肥','高浓度复合肥','硝酸磷肥','硝酸磷钾肥','混配复合肥料','复混粉状肥','硫酸钾复合肥','三元含硫复合肥','含氮普钙','缓施复合肥','氯基三元复合肥','硝基复合肥','多元液体复合肥','稀土复合肥','复合氨基酸液肥','BB肥','复合氨基酸粉', '氨基酸复合肥', '尿基复合肥', '有机复合肥', '硅钙磷肥', '硅钙肥','气肥']],
             ['氮肥/磷肥/钾肥',['合成氨','氨水','液氨','尿素','长效尿素','过碳酰胺','缓释尿素','含硫尿素','异丁叉二脲','氯化铵','硝酸铵','硫酸铵','碳酸氢铵','增效碳酸氢铵','硝铵磷锌','硝酸钙(农用)','双烧磷肥','钙镁磷肥','重过磷酸钙','过磷酸钙','颗粒磷肥','富过磷酸钙','硫磷铵','白磷肥','磷酸氢钙(农用)','氯化钾(农用) ','硫酸钾(农用)','增效硫酸钾','生物钾肥','高钾喷施肥','五氯钾镁肥','磷酸二氢钾(农用)']],
             ['微量元素肥料',[ '混合肥料','锌肥','稀土微肥','硼肥','硅肥','硫镁肥','叶面肥','高效叶面肥','农用硫酸锌', '氨基酸锌']],
             ['腐殖酸',['黄腐殖酸','硝基腐殖酸','腐殖酸钠','硝基腐殖酸镁','硝基腐殖酸钙','硝基腐殖酸铵','腐殖酸铵','腐殖酸硼','腐殖酸镁','腐殖酸硼镁','腐殖酸钙','腐殖酸磷肥','腐殖酸复合肥','腐殖酸液肥']],
             ['专用肥',['水稻专用肥','烟草专用肥','西瓜专用肥','甘蔗专用肥','玉米专用肥','大豆专用肥','棉花专用肥','蔬菜专用肥']]
         ]
      ]
   ]
   b.each do |t|
     s = self.new
     s.cate_id = 1
     s.parent_id = 0
     s.name = t[0]
     s.status = 1
     s.save
     t[1].each do |m|
       v = self.new
       v.cate_id = 2
       v.parent_id = s.id
       v.name = m[0]
       v.status = 1
       v.save
       m[1].each do |n|
         w = self.new
         w.cate_id = 3
         w.parent_id = v.id
         w.name = n
         w.status = 1
         w.save
       end
     end
   end
 end

end
